In [ ]:
#Indexing Data frames wiith default indexes, i.e column number with iloc syntax

In [2]:
import pandas as pd
Emp_Details = pd.DataFrame({'Name_Emp':['Andy Simpson', 'John Anderson', 'Liza Brooke'], 'Age':[34,45, 23],
                            'GT_5_yrs':[True, False, False]})
Emp_Details

        Name_Emp  Age  GT_5_yrs
0   Andy Simpson   34      True
1  John Anderson   45     False
2    Liza Brooke   23     False

In [3]:
#indexing rows only - first reference to rows then to columns
Emp_Details.iloc[2, :]

Name_Emp    Liza Brooke
Age                  23
GT_5_yrs          False
Name: 2, dtype: object

In [4]:
#or
Emp_Details.iloc[2]

Name_Emp    Liza Brooke
Age                  23
GT_5_yrs          False
Name: 2, dtype: object

In [6]:
#indexing columns only
Emp_Details.iloc[:,1]

0    34
1    45
2    23
Name: Age, dtype: int64

In [7]:
#indexing rows and columns
Emp_Details.iloc[1, 1]

45

In [8]:
#indexing the series of cols or rows wioth colons (0 to n-1)
Emp_Details.iloc[0:2, 0:2]

        Name_Emp  Age
0   Andy Simpson   34
1  John Anderson   45

In [9]:
#indexing out of sequences
Emp_Details.iloc[[0,2], :]

       Name_Emp  Age  GT_5_yrs
0  Andy Simpson   34      True
2   Liza Brooke   23     False

In [10]:
#Indexing Data Frames with customized indexes with loc syntax

In [11]:
Emp_Details = pd.DataFrame({'Name_Emp':['Andy Simpson', 'John Anderson', 'Liza Brooke'], 'Age':[34,45, 23],
                            'GT_5_yrs':[True, False, False]}, index = ['Andy', 'John', 'Liza'])
Emp_Details

           Name_Emp  Age  GT_5_yrs
Andy   Andy Simpson   34      True
John  John Anderson   45     False
Liza    Liza Brooke   23     False

In [12]:
Emp_Details.loc['Andy',:]

Name_Emp    Andy Simpson
Age                   34
GT_5_yrs            True
Name: Andy, dtype: object

In [13]:
#or
Emp_Details.loc['Andy']

Name_Emp    Andy Simpson
Age                   34
GT_5_yrs            True
Name: Andy, dtype: object

In [14]:
#two rows together
Emp_Details.loc[['Andy', 'Liza'], :]

          Name_Emp  Age  GT_5_yrs
Andy  Andy Simpson   34      True
Liza   Liza Brooke   23     False

In [15]:
#columns and row index name
Emp_Details.loc['Andy':'Liza', ['Age', 'Name_Emp']]

      Age       Name_Emp
Andy   34   Andy Simpson
John   45  John Anderson
Liza   23    Liza Brooke